import styled from "styled-components";
import { StyledContainer } from "./Container";
import Accordion from "./Accordion";

const StyledFaq = styled(StyledContainer)`
  padding: 1.2rem 0 2.4rem;
`;

const faq = [
  {
    id: 1,
    title: "امکانات ترخینه",
    titleDesktop: "ترخینه چه امکانات متفاوتی داره؟",
    description:
      "وبسایت سفارش غذای رستوران‌های زنجیره‌ای ترخینه با اتصال مستقیم به نرم افزار اتوماسیون شعبات رستوران، امکان اشتباهات هنگام ثبت سفارش آنلاین غذا و همچنین زمان مورد نیاز برای آماده سازی و تحویل آن را به حداقل ممکن می رسونه.",
  },
  {
    id: 2,
    title: "حساب کاربری در ترخینه",
    titleDesktop: "چطور می تونم در ترخینه حساب کاربری ایجاد کنم؟",
    description:
      "خیلی ساده، پس از انتخاب غذای مورد علاقه تان از منوی رستوران، هنگام ثبت سفارش با وارد کردن شماره تلفن همراه یک پیامک حاوی کد تایید برای شما ارسال و با وارد کردن کد تایید، ثبت نام شما تکمیل می شه. یا می تونید در صفحه اصلی سایت روی گزینه ورود کلیک کنید.",
  },
  {
    id: 3,
    title: "سابقه خرید",
    titleDesktop: "سابقه و لیست خریدهای قبلی ام رو کجا ببینم؟",
    description:
      "با ورود به حساب کاربری و کلیک روی گزینه سفارشات قبلی سابقه تمام خریدهای شما نمایش داده می شه.",
  },
  {
    id: 4,
    title: "راه‌های پرداخت",
    titleDesktop: "چه راه هایی برای پرداخت دارم؟",
    description:
      "هنگام ثبت سفارش غذا می تونید روش پرداخت دلخواه خودتون رو انتخاب کنید. آنلاین و یا نقدی در هنگام تحویل سفارش بصورت حضوری.",
  },
  {
    id: 5,
    title: "تفاوت قیمت در منو شعبات و منو وبسایت",
    titleDesktop:
      "آیا قیمت در منوی وبسایت ترخینه با قیمت منوی شعبات رستوران یکسان است؟",
    description:
      "بله. قیمت منوی وبسایت ترخینه دقیقا مطابق با قیمت منوی شعب رستوران  است و در صورت تغییر قیمت از طرف رستوران این تغییر در وبسایت ترخینه بلافاصله قابل مشاهده است.",
  },
  {
    id: 6,
    title: "هدیه و تخفیف",
    titleDesktop: "چطور می تونم از اعتبار هدیه و تخفیف استفاده کنم؟",
    description:
      "برای استفاده از کد تخفیف میتونید به سادگی کد رو در سبد خرید، در قسمت مشخص شده وارد کنید. اعتبار هدیه هنگام انتخاب روش پرداخت برای شما نمایش داده میشه و در صورت تمایل میتونید ازش استفاده کنید.",
  },
];

function Faq() {
  return (
    <StyledFaq>
      <Accordion>
        {faq.map((option) => (
          <Accordion.Item key={option.id} option={option} />
        ))}
      </Accordion>
    </StyledFaq>
  );
}

export default Faq;
